{
 "title":"Starting from scratch – Mobile Core Network Honeypot",

 "synopsis":"<b>Duration:</b> 50 min + 10 min Q&A\n\n<b>Presenters:</b> Silke Holtmanns, Falvia Sebeni\n\nSilke has been hanging around in mobile security for 18 years. She had fun with mobile payments, the air interface, SIM cards, phones and now with the core of the mobile networks. After designing over 10 years 3GPP security, she decided to get to get into the dark area between the networks….She has a sweet spot for telco protocols, Taekwondo, cakes, portrait paintings and pen testing.\nFlavia has a background in software development and telco data analysis. She enjoys digging into the security aspects of (mobile) networks, travelling and good food.\nAbstract: How do mobile networks actually work, when you connect? What happens if somebody calls you from another network? How does security work there? What are the attacks there?\nWe will introduce mobile core network security and explain, how attackers exploit the system. Mobile networks do not have the IT security \"history\", so we have to start from scratch to protect them (some do not have even IP!). Machine learning is a good tool, but one needs the “right data”. We describe how we are tackling nation state attacks with machine learning on telco networks. It is a journey... and we will give an outline for 5G.\n\n<b>Detailed Outline:</b>\n\n<b>General idea: </b>\nMinimize the \"telco speak / abbreviations\" and get over the message how we need to build up protection for mobile networks\nNote: If the conference has another mobile core network security talk, then the Intro can be shortened and we can roll a bit on the details and the machine learning.\n\nIntroduction to mobile connectivity (mobile IPX explained for the rest of us...) - Silke\n- What actually happens when your device connects to a cellular network\n- Explaination of the background messages that happen when a user roams (linkage to audience)\n- Explaination of relationship of operators toward each other\n\nInterconnection - IPX - the hidden private Internet\n- What is it?\n- A network developed to enable roaming\n- Where does it come from?\n&nbsp;&nbsp;- Developed over 35 years ago\n&nbsp;&nbsp;- Designed as closed private network by 5 operators\n- Evolution of mobile networks\n&nbsp;&nbsp;- Now roughly 2000 operators + many service providers\n&nbsp;&nbsp;- Mix and match of technologies and protocols\n&nbsp;&nbsp;- Opens up more and more (examples given)\n- How does this relate to the audience?\n&nbsp;&nbsp;- Does this interest me, I don't travel? -> yes you are still reachable via IPX\n&nbsp;&nbsp;- IoT connectivity (e.g. car) -> everything is connected\n\n Attacks on IPX\n- Attackers: nation states, criminals, military (known attacks)\n&nbsp;&nbsp;- NSA Auroragold, GCHQ Belgacom\n&nbsp;&nbsp;- Banking TAN attack\n&nbsp;&nbsp;- Drone program - data acquisition from cellular networks for targeted attacks\n&nbsp;&nbsp;- Crypto vault hack using one time password hijacking\n- What did they do?\n&nbsp;&nbsp;- Location Tracking, DoS, exploits, password pishing, data interception, eavesdropping\n&nbsp;&nbsp;- Attacks will be sorted by technology used to perform them (i.e. 2G, 3G/4G)\n\n- How do attackers get in? - Example screen shots will be shown, maybe I show some life\n&nbsp;&nbsp;- Darknet\n&nbsp;&nbsp;- Service companies\n&nbsp;&nbsp;- Hack your way in\n&nbsp;&nbsp;- Trick a local operator\n\n- What is the world doing?\n&nbsp;&nbsp;- Mobile industry (red pill, blue pill, both pills...)\n&nbsp;&nbsp;- How to change a dinosaurus\n&nbsp;&nbsp;- Large variety between operators and countries! Not all networks equally vulnerable\n&nbsp;&nbsp;- Regulators (Fin, US, EU, Canada, China)\n\n- What is the next perfect storm?\n- Malware in networks\n- Kill switches in network\n\n- Can we not just put here antivirus and a nice FW?\n- Telco protocols are different and have their own logic (some example flow will be shown)\n- We talk about lot of data, we can not do it by hand\n- No labelled data set for attack there, who has a fully labeled data set for telco attacks?\n\nOur honeypot (Flavia)\n- IPX network technology (I'm afraid we will not be able to avoid some abbreviations in that section of the talk)\n&nbsp;&nbsp;- Which nodes connect to each other\n&nbsp;&nbsp;- How do they connect and why?\n\n- Architecture used in our honeypot\n&nbsp;&nbsp;- Brief introduction on the set-up and software used\n&nbsp;&nbsp;- How does it look from the outside and why do we make it look like that?\n&nbsp;&nbsp;- Ports open and why those\n\n- Findings\n- Normal stuff (scanning, OS specific etc)\n&nbsp;&nbsp;- The interesting attacks\n\n- Applying Machine Learning\n\nSome labelled attacks now there\nFeature extraction for real traffic (comes over IPX and not Internet, so some adaption needed)\nTake real traffic data and cluster around the found labeled attack\n5G Outlook\nRisks for 5G IPX traffic\n\nSummary & Wrap-up",
 "speakers":
 [
	 { "name" : "Flavia Sebeni",    "img" : "falvia_sebeni" },
   { "name" : "Silke Holtmanns",   "img" : "default" }

 ]

}
